# -*- coding: utf-8 -*-
"""Story config.
"""
################################################################
#
# Sample:
#
# 1) PERSONS
#       人物簡易設定
# 2) STAGES
#       舞台基本設定
# 3) DAYS
#       年月日設定
# 4) TIMES
#       時間帯基本設定
# 5) ITEMS
#       小道具設定
# 6) WORDS
#       辞書設定
# 7) RUBIS
#       ルビ設定
# 8) LAYERS
#       レイヤ設定
#
################################################################


PERSONS = (
        # Tag / 氏,名 / 歳 / 誕生日 / 性別 / 職業 / 呼称 / 紹介
        ("altair", "アル", "アルタイル", 16, (1,1), "male", "セブンス", "me:僕"),
        ("vega", "ベガ", "ベガ", 17,(1,1), "female", "セブンス", "me:わたし"),
        ("deneb", "デネブ", "デネブ", 18,(1,1), "female", "セブンス", "me:私"),
        ("spica", "スピカ", "スピカ", 19,(1,1), "female", "セブンス", "me:ワタシ"),
        ("rigel", "リゲル", "リゲル", 15,(1,1), "male", "セブンス", "me:オレ"),
        ("capella", "カペラ", "カペラ", 22,(1,1), "female", "セブンス", "me:あたい"),
        ("pollux", "ポル", "ポルックス", 10,(1,1), "male", "セブンス", "me:ボク"),
        ## 主要人物
        ("canopus", "カノープス", "カノープス", 25,(1,1), "male", "セブンス", "me:俺"),
        ## ラボ
        ("atria", "アトリア", "アトリア", 27,(1,1), "female", "スタッフ", "me:わたし"),
        ("denebola", "デネボラ", "デネボラ", 45,(1,1), "female", "スタッフ", "me:私"),
        )

AREAS = (
        # Tag / 名前 / x,y / 備考
        ("Aurasa", "アウラサ", 0,0),# ユーラシア大陸
        ("Rakuen", "楽園島", 13833,3804),# 佐渡
        ("StRubell", "セントールベル", 104,5116),# カンタベリー（英国）
        ("Breuccel", "ブロイセル", 435,5085),# ブリュッセル
        ("Warcia", "ヴァルシア", 2101,5222),# ワルシャワ
        ("Centusburg", "セントゥスブルク", 3761,5575),# モスクワ
        ("Haido", "灰土砂漠", 7655,4315),# アルマトイ／サルイイシコトラウ砂漠
        ("Asana", "アサナ", 7147,5116),# アスタナ
        ("ElTai", "エル・タイ山脈", 4858,8957),# アルタイ山脈／ウルギーの場所を利用
        ("UlBostok", "ウル・ボストク", 13152,4306),# ウラジオストク
        )

STAGES = (
        # Tag / 名前 / Area / 紹介
        ("rakuen", "楽園", "Rakuen", "最終目的地"),
        ("labo", "第七ラボ", "StRubell", "普段暮らしている施設"),
        ("mtsnow", "雪山", "ElTai"),
        ("porttown", "港町", "UlBostok"),
        )

DAYS = (
        # Tag / 名前 / 月 / 日 / 年
        ("escape", "ラボから脱出日", 9,1, 2120),
        ("entermount", "入山日", 12,6, 2120),
        ("division_party", "分裂日", 12,10, 2120),
        ("descent", "下山日", 12,16, 2120),
        ("rakuen1", "楽園一日目", 12,18, 2120),
        ("rakuen2", "楽園二日目", 12,19, 2120),
        ("rakuen3", "楽園三日目", 12,20, 2120),
        ("rakuen4", "楽園四日目", 12,21, 2120),
        ("rakuen5", "楽園五日目", 12,22, 2120),
        ("rakuen6", "楽園六日目", 12,23, 2120),
        ("rakuen7", "楽園七日目", 12,24, 2120),
        )

TIMES = (
        # Tag / 名前 / 時 / 分
        )

ITEMS = (
        # Tag / 名前 / 紹介
        )

WORDS = (
        # Tag / 名前 / 紹介
        ("mushi", "蟲型", "蟲の形をしたナノマシン"),
        )

RUBIS = (
        # Base / Rubi / Exclusion / Type
        )

LAYERS = (
        # Key / Title / Words
        )

